{
  "Apps": [
    {
      "WEBTOON: Manga, Comics, Manhwa": {
        "appId": "com.naver.linewebtoon",
        "name": "WEBTOON: Manga, Comics, Manhwa",
        "icon": "https://play-lh.googleusercontent.com/RpY2HMoj2ZfD2CIy4-atnMUUU0gPk6afkefze7kC-XDgJqJW7fQc70yGdl8KOcxYSA",
        "developer": "NAVER WEBTOON",
        "genre": "Comics",
        "score": 4.547658,
        "installs": "100,000,000+",
        "summary": "The largest manga, comics, and manhwa community with millions of fans!",
        "description": "Join the largest manga, comics, and manhwa community in the world with millions of fans and creators on WEBTOON!\r\n \r\nWhy you'll love WEBTOON:\r\n- Access millions of episodes for FREE!\r\n- Explore the world’s largest selection of webcomics spanning diverse genres like action, romance, thriller and everything in between.\r\n- Now you can read or watch fan-favorite stories like never before with Video Episodes - anytime, anywhere, free!\r\n- Find your next obsession with personalized recommendations and series highlights in the NEW & HOT tab.\r\n- Enjoy global hits like Lore Olympus, The Mafia Nanny, Omniscient Reader, School Bus Graveyard and The Remarried Empress.\r\n- Read familiar favorites and graphic novels like Fullmetal Alchemist, Batman: Wayne Family Adventures, Godzilla, Avatar: The Last Airbender and From Old Country Bumpkin to Master Swordsman.\r\n- Home to the original webcomics behind the TV and film adaptations of Tower of God, True Beauty, Sweet Home and Marry My Husband streaming on Netflix, Disney+, and Crunchyroll and more.\r\n- Engage with a thriving community of fellow enthusiasts and creators by subscribing to your favorite series and making your voice heard through the comments section!\r\n- Unlock premium content like full series access and early episode access by buying Coins\r\n\r\nAre you a storyteller at heart? Use our CANVAS platform to publish your own webcomics and reach a global audience. Share your story and build your own community. WEBTOON is where you find your fandom.\r\n\r\nWebsite: https://www.webtoons.com/en/\r\nTerms of Use: https://www.webtoons.com/en/terms\r\n\r\nCheck out WEBTOON on socials!\r\nInstagram: https://www.instagram.com/webtoonofficial\r\nTikTok: https://www.tiktok.com/@webtoonofficial\r\nYouTube: https://www.youtube.com/webtoonofficial\r\nX: https://x.com/webtoonofficial",
        "updated": 1756874277,
        "size": "",
        "version": "3.7.6",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.naver.linewebtoon"
      }
    },
    {
      "Marvel Unlimited": {
        "appId": "com.marvel.unlimited",
        "name": "Marvel Unlimited",
        "icon": "https://play-lh.googleusercontent.com/ikcy-XJG8_oFwVztH9vK3y--_mUcRu5zyco7d4FqugxzSkX9wMo63oBDPLWZnUsYDg",
        "developer": "Marvel Comics",
        "genre": "Comics",
        "score": 4.695985,
        "installs": "5,000,000+",
        "summary": "Instant access to over 30,000 Marvel comics with new issues added every week.",
        "description": "Marvel Unlimited is Marvel’s premier digital comics subscription service. Gain instant access to over 30,000 digital comics and over 80 years of comic books through the Marvel Unlimited app, or your web browser. Start your 7-day free trial now!\r\n\r\nMarvel Unlimited features all of your favorite characters from Marvel movies, TV shows, and video games. Read the comic books that inspired your favorite super heroes and villains on the big screen!\r\n\r\nExperience the all-new digital comic format, Marvel’s Infinity Comics available exclusively on Marvel Unlimited. Featuring in-universe stories from top creators told in visionary vertical format, designed for your device.\r\nRead comics and stories about Spider-Man, Iron Man, Captain America, Captain Marvel, The Avengers, Thor, Hulk, the X-Men, the Guardians of the Galaxy, Star Wars, Doctor Strange, Deadpool, Thanos, Mysterio, Ant-Man, The Wasp, Black Panther, Wolverine, Hawkeye, Wanda Maximoff, Jessica Jones, the Defenders, Luke Cage, Venom, and many more! \r\n\r\nWondering where to start? Check out endless reading guides curated by Marvel experts to guide you through the last 80 years of the Marvel Universe. Read about comic events that inspired the movies such as the Spider-Verse, Civil War, Thanos and the Infinity Gauntlet, and even Star Wars!\r\nUnlimited downloads allows you to read as many comics as you want offline and on-the-go! Follow your favorite characters, creators and series and get notified when new issues come out! Marvel Unlimited is available on mobile phones, tablets, and anywhere you can access the web.\r\nKey Features:\r\n• Access over 30,000 Marvel comics at your fingertips\r\n• Infinity Comics, in-universe stories from top creators designed for your device\r\n• Endless reading guides\r\n• Unlimited downloads to read anywhere\r\n• Personalized comic book recommendations\r\n• Sync progress across devices\r\n• New comics and old classics added every week\r\n• No commitments. Cancel online at any time.\r\n\r\nChoose from three different Marvel Unlimited comic subscription plans as follows:\r\n\r\n• Monthly – Our most popular plan!\r\n• Annual – Great savings!\r\n• Annual Plus – Get a new, exclusive merchandise kit each year you’re a member! (US Only)\r\n\r\nHelpful Links:\r\n\r\n• Terms of Use: https://disneytermsofuse.com \r\n• Privacy Policy: https://disneyprivacycenter.com\r\n• Subscriber Agreement: https://www.marvel.com/corporate/marvel_unlimited_terms \r\n• California Privacy Rights: https://privacy.thewaltdisneycompany.com/en/current-privacy-policy/your-california-privacy-rights \r\n• Do Not Sell My Info: https://privacy.thewaltdisneycompany.com/en/dnsmi \r\n\r\n• Marvel Unlimited: https://www.marvel.com/unlimited\r\n• Marvel: https://www.marvel.com\r\n\r\nSubscription via Google Play\r\n\r\nDownload the app and sign up to start reading. Your membership will automatically renew each month. You can cancel at any time. Your subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the then-current subscription period. Your payment method associated with your Google Play account will automatically be charged at the same price for renewal, as stated above, within 24 hours prior to the end of the then-current billing period. You can manage your subscription and/or turn off auto-renewal by visiting your Google Play Subscriptions after purchase. Any unused portion of a free trial period will be forfeited when the user purchases a subscription to that publication.\r\n\r\nBefore you download this app, please consider that it may include or support advertising, some of which the Walt Disney Family of Companies may target to your interests. You may choose to control targeted advertising within mobile applications by using your mobile device settings (for example, by re-setting your device's advertising identifier and/or opting out of interest-based ads).",
        "updated": 1756484411,
        "size": "",
        "version": "7.91.0",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.marvel.unlimited"
      }
    },
    {
      "WebComics - Webtoon & Manga": {
        "appId": "com.webcomics.manga",
        "name": "WebComics - Webtoon & Manga",
        "icon": "https://play-lh.googleusercontent.com/UWL2zfGC3tIy-0Z86E9Oa8BjJAFSgwpDNuAQurKYBqE-bZSEO3BIYHzX-MTGy7b1pvw",
        "developer": "WEBCOMICS HOLDINGS HK LIMITED",
        "genre": "Comics",
        "score": 4.3712573,
        "installs": "10,000,000+",
        "summary": "Read Manga, Comics & Manhwa of Romance, Action, Fantasy, Drama, BL and more!",
        "description": "<b>WebComics™</b> is the ultimate destination for Comic & Manhwa fans worldwide, offering the latest and hottest authentic comic series. Whether you're a fan of Manga, Manhwa, or Webtoon, we offer an exhilarating and high-definition comic-reading experience, indulging you in the most popular manga & manhwa genres, including Romance, Action, Fantasy, Comedy, BL, GL, Drama, Horror, and more. It's your go-to platform for reading the best stories.\r\nWith over 8,000 authentic Manhwa & Comic available for online reading, WebComics™ features the latest releases of comics, manga, manhwa, manhua, and webtoons. Whether you fancy billionaires, destined partners, dominant CEOs, vampires, love triangles, otherworldly adventures, time-travel, enemies-to-lovers, or contractual marriage, there's something for everyone. Come explore the vast array of manga &comic series directly from your mobile phones, tablet devices, or PCs. Just enjoy reading webtoons on <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.webcomicsapp.com&sa=D&sntz=1&usg=AOvVaw2Vod35HjwgQTne-bU7RzEv\">webcomicsapp.com</a>.\r\n\r\n<b>Why Choose WebComics™</b>\r\n<b>1. A World of Infinite Comic & Manga Excitement</b>\r\nWebComics™ presents top-notch and exclusive comics, manga & manhwa from acclaimed creators worldwide. Our all-covered genres cater to your every interest and preference!\r\n<b>2. Unparalleled Experience in Reading Exclusive Comics & Manhwa</b>\r\nWebComics™ offers a plethora of exclusive original manhwa, manga & webtoons featuring distinctive and innovative storytelling, unparalleled creativity, and a reading experience that stands out as top-tier.\r\n<b>3. Daily Free Reading Privileges</b>\r\nEnjoy daily free reading perks on WebComics™ that caters to fans of Romance, Action, Fantasy, or LGBTQ genres. Come back each day for our newest free manhwa, webtoon & manga giveaway events!\r\n<b>4. Tailored Recommendations Just for You</b>\r\nWe push personalized and captivating manhwa & manga suggestions that perfectly align with your interests.\r\n<b>5. Free Downloads and Offline Reading Convenience</b>\r\nNo Internet? No worries! Download your preferred stories at no cost and enjoy them offline, ideal for travel or time killing.\r\n\r\n<b>Trending Manhwa & Manga, Webtoon at WebComics™</b>\r\n＃Action / Sci-fi comics＃——The Unstoppable\r\n＃Fantasy manhwa＃——The Jobless Guy Who Has Come to Slay\r\n＃Action manga＃——The Invincible Warlord\r\n＃Romance manhwa＃——The True Heiress Is an All-Powerful Bigshot\r\n＃Drama webtoon＃——Spoiled Rotten by My Uncles\r\n＃Modern Romance manhwa＃——Live Happily Ever After With My Exes\r\nWebComics™ features a vast library of webtoon, manga and manhwa, with over 5 million reads on numerous genres. You can read these manga & manhua without the need to purchase physical copies!\r\n\r\n<b>Top-ranking Author Team</b>\r\nJoin our diverse community of WebComics authors from around the globe! Access exclusive original comics and manga series only available on our platform. Our talented webtoon & comic creators produce captivating content daily. Don't miss out on the opportunity to showcase your skills and become a renowned cartoonist! Join WebComics and become a professional author now!\r\nIf you're a comic creator aspiring to publish your own comic or webtoon, please send us your work! \r\nEmail: <a href=\"mailto:comiceditor@webcomicsapp.com\">comiceditor@webcomicsapp.com</a>\r\n\r\n<b>Follow Us</b>\r\nDownload WebComics™ today and unlock a world of manhwa & manga waiting to be discovered!\r\nWebComics Social Media\r\nFacebook: <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.facebook.com%2FWebComicsOfficial%2F&sa=D&sntz=1&usg=AOvVaw0StQ-9AcQGIdKHws9Rakcj\">@WebComicsOfficial</a>\r\nTwitter: <a href=\"https://www.google.com/url?q=https%3A%2F%2Ftwitter.com%2FWebcomics_app&sa=D&sntz=1&usg=AOvVaw05g4wqe6-51vWTyNStLVDf\">@Webcomics_app</a>\r\nInstagram: <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.instagram.com%2Fwebcomics_official%2F&sa=D&sntz=1&usg=AOvVaw2kFQOdts62v7P84D3VMT3r\">@WebComicsOfficial</a>\r\nWebsite: <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.webcomicsapp.com&sa=D&sntz=1&usg=AOvVaw2Vod35HjwgQTne-bU7RzEv\">webcomicsapp.com/</a>\r\nCustomer Service Email: <a href=\"mailto:Webcomics@sidewalkgroup.com\">Webcomics@sidewalkgroup.com</a>\r\n\r\nAll content on WebComics is serviced in official partnership with the respective publishers, creators and artists.\r\n<b>© WebComics™ - All rights reserved.</b>",
        "updated": 1757557492,
        "size": "",
        "version": "3.6.60",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.webcomics.manga"
      }
    },
    {
      "Manta: Comics & Graphic Novels": {
        "appId": "net.manta.comic",
        "name": "Manta: Comics & Graphic Novels",
        "icon": "https://play-lh.googleusercontent.com/fx5DAs6vFwchNNv8k3b575uSyBBOzD_k261SdaFQC_Jcd2EnVsTE4knbXEXRLgSQZQ",
        "developer": "RIDI Corporation",
        "genre": "Comics",
        "score": 3.6778524,
        "installs": "5,000,000+",
        "summary": "Finest collection of Manga and Manhwa. Official provider with regular updates!",
        "description": "Welcome to Manta – Your Ultimate Comics and Novels Destination!\r\n\r\nImmerse yourself in the captivating universes of Manta, where a diverse collection of stories unfolds across webtoons, webcomics, manhwa, manga, manhua, and novels. Whether you’re captivated by romance, thrilled by action, enchanted by fantasy, chilled by horror, intrigued by BL (yaoi), or swept away by romantasy, our extensive library offers stories that cater to every taste. With Manta, experience immersive storytelling, stunning artwork, and boundless creativity—right at your fingertips.\r\n\r\nWith Free Pass, you can read one free episode every 24 hours — available on select titles only.\r\nNo need to pay — just wait and enjoy your favorite stories, day by day.\r\nFree Pass titles include both Gem‑Only and Subscription series.\r\n\r\nDiscover Your Next Favorite Story\r\n\r\n- Try our hit series Under the Oak Tree, a fan-favorite loved by millions worldwide.\r\n\r\n\r\n- Romance fan? We’re your go-to for epic love tales, featuring exclusives like Tempest Night, Predatory Marriage, Betrayal of Dignity, I’ve Become a True Villainess, Redemption of the Earl of Nottingham, High Society, and more\r\n\r\n\r\n- Searching for BL? We’re the perfect choice with popular BL titles like Semantic Error, Love Jinx, No Love Zone, The New Recruit, The Dangerous Convenience Store, The Dirtiest High, and many more!\r\n\r\n\r\n- Craving more after the comics? Discover original novels that delve deeper into each world, revealing new layers of the characters and their stories.\r\n\r\nChoose from our subscription library for unlimited access to exclusive tales, or select individual episodes from a larger library to satisfy your unique story cravings.\r\n\r\nFor more, please visit:\r\n\r\nWebsite: http://www.manta.net\r\nInstagram: http://instagram.com/mantacomics\r\nTwitter: http://twitter.com/mantacomics\r\nPrivacy Policy: https://mantasupport.zendesk.com/hc/en-us/articles/360056564334-Privacy-Policy\r\nTerms of Use: https://mantasupport.zendesk.com/hc/en-us/articles/360056568354-Terms-of-Service",
        "updated": 1757580811,
        "size": "",
        "version": "25.8.427",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=net.manta.comic"
      }
    },
    {
      "GlobalComix: Comic Book Reader": {
        "appId": "com.globalcomix.mobileapp",
        "name": "GlobalComix: Comic Book Reader",
        "icon": "https://play-lh.googleusercontent.com/MPIKjdFL-r8jOP3uF-tTd5uoE0_DwcCNVBbIJybpC1hUK8DYllUelzRdpteLUaoRIV3S",
        "developer": "GlobalComix",
        "genre": "Comics",
        "score": 4.5128207,
        "installs": "100,000+",
        "summary": "Read Superman, Invincible & more with 100k+ comics inside.",
        "description": "100,000+ comics. One low monthly price.\r\nDive into Superman, Invincible, The Witcher, and more—for less than the cost of a single comic book.\r\n\r\nRead iconic titles like Batman, The Boys, Transformers, Hellboy, The Walking Dead, and The Umbrella Academy—alongside thousands of indie comics, manga, webcomics, and vertical scroll series you won’t find anywhere else.\r\n\r\nNEW COMICS DROP WEEKLY\r\nEvery week brings a fresh batch of stories to explore. Browse curated collections, see what’s trending, and find your next favorite across a library of over 100,000 releases.\r\n\r\nGC VERTICAL ORIGINALS\r\nExperience stories built for mobile. With over 1,200 episodes across 30+ series, our vertical scroll comics deliver a cinematic read—perfect for daily doses of action, drama, or comedy.\r\n\r\nCOMICS FROM 350+ PUBLISHERS\r\nAccess titles from DC, Image, Dark Horse, BOOM! Studios, TOKYOPOP, Mad Cave, and more. Read Justice League, Nightwing, The Sandman, Joker, and yes—plenty of Superman—all in one app.\r\n\r\nA READING EXPERIENCE BUILT FOR YOU\r\nRead panel-by-panel or page-by-page. Scroll vertically or swipe horizontally. Follow your favorite series, track your reading, jump between chapters, and leave comments in a vibrant comics community.\r\n\r\nDISCOVER LIKE NEVER BEFORE\r\nUse advanced filters to find exactly what you want—by genre, art style, theme, publisher, audience, and more. Explore dedicated publisher channels and go deeper than algorithmic recommendations.\r\n\r\nOFFLINE READING ON THE GO\r\nDownload comics and read anywhere with a GlobalComix Gold subscription—perfect for planes, commutes, and lazy weekends.\r\n\r\nSUPPORT THE CREATORS WHO MAKE THE STORIES\r\nGlobalComix is a creator-first platform. Up to 70% of your subscription goes directly to the publishers and artists behind the comics you love.\r\n\r\nCOMIC BOOKS REIMAGINED FOR MODERN FANS\r\nIf you’ve enjoyed platforms like Comixology, you’ll find GlobalComix a fresh, modern alternative—designed for discovery, built for fans, and ready to grow with you.",
        "updated": 1756472794,
        "size": "",
        "version": "2.2.8",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.globalcomix.mobileapp"
      }
    }
  ],
  "TOP_FREE": [
    {
      "Tinder Dating App: Chat & Date": {
        "appId": "com.tinder",
        "name": "Tinder Dating App: Chat & Date",
        "icon": "https://play-lh.googleusercontent.com/fDpoqIbZ884ylRnMK8Lx9Fu4DsLQk5yt4f9WkxeOAPpGnzc9BTi_YKkMsLvoMdx7Uzg",
        "developer": "Tinder LLC",
        "genre": "Dating",
        "score": 3.7813375,
        "installs": "100,000,000+",
        "summary": "The dating app for adults to match singles online, meet people & make friends",
        "description": "<b>MATCH, CHAT & DATE. IT STARTS WITH A SWIPE™.</b>\r\n\r\nWith 97+ billion matches to date, Tinder® is the top free dating app and the best place to meet new people, with leading safety features to date more safely. Looking for love? A relationship? Trying to find a date or make new friends? Connect with people globally on Tinder and enhance your dating experience:\r\n\r\nCome As You Are: Whether you're straight, gay, bisexual, or anything in between, you can be who you are and find who you want.\r\nDate Beyond Photos: Share interests and discover more about your matches to start conversations.\r\nSeek What You’re Looking For: Set relationship goals and date on your terms.\r\n\r\n<b>HOW TINDER WORKS</b>\r\nFinding new people and dating on Tinder® can be easy and fun. Make your personality shine in your profile to stand out. Answer prompts, share about yourself, and show your face in pics to increase match potential. Use Swipe Right™ feature to Like and Swipe Left™ feature to Nope. If they Like you back, It’s a Match! Our double opt-in feature ensures mutual interest for every match.\r\n\r\n<b>PUT SAFETY FIRST</b>\r\nTry our safety features for safer dating: \r\n\r\n- Share My Date: Inform friends and family about your date plans — who you’ll meet up with and where\r\n- Get Photo Verified: Verify your photos to confirm it’s really you in that cute pic and increase your matching chances\r\n- Are You Sure / Does This Bother You: Detects inappropriate language to keep messages respectful\r\n- Report a Profile: Quickly report / block suspicious or inappropriate profiles\r\n- Block Contacts: Take control and block anyone (like an ex) you don’t want to see on this dating app\r\n- Video Chat: Hitting it off in chat? Test your online dating chemistry and meet new people from home!\r\n\r\n<b>TRY TINDER PLUS</b>\r\n- Unlimited Likes: Catch feelings for as many new dates as you want\r\n- Passport Mode™: Match and chat with locals anywhere in the world before you arrive\r\n- Unlimited Rewinds: Undo your last Like or Nope to control your dating choices\r\n- Go Incognito: Be seen only by the people you Like\r\n\r\n<b>EXPERIENCE TINDER GOLD</b>\r\n- Get everything in Tinder Plus™ \r\n- Try for a week before committing to a monthly subscription — ideal for dating and meeting new people\r\n- See who Likes You to match instantly for quicker connections, making dating more exciting\r\n- Monthly Boost puts your profile at the top for 30 minutes to increase profile views\r\n- Weekly Super Likes, because sometimes you really, really Like someone\r\n\r\n<b>UPGRADE TO TINDER PLATINUM</b>\r\nGet most of Tinder’s premium features: Join Tinder Platinum™ to prioritize your Likes with potential matches, send a compliment before matching, and more dating perks.\r\n\r\nSo what are you waiting for? Tinder offers safety dating features to meet new people and make friends confidently. Join millions of people worldwide to increase your chances of finding exactly what you're looking for. Download our free dating app today!\r\n\r\n---------------\r\nIf you choose to purchase Tinder Plus®, Tinder Gold™ or Tinder Platinum™ payment will be charged to your Google Play account, and your account will be charged for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the Google Play Store after purchase. No cancellation of the current subscription is allowed during the active subscription period. If you don’t choose to purchase Tinder Plus®, Tinder Gold™ or Tinder Platinum™, you can simply continue using Tinder for free.\r\n\r\nAll photos are of models and used for illustrative purposes only.\r\n\r\nPrivacy: https://www.gotinder.com/privacy\r\nTerms: https://www.gotinder.com/terms\r\nVisit: https://www.tinderlove.com/",
        "updated": 1757538926,
        "size": "",
        "version": "16.20.3",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.tinder"
      }
    },
    {
      "Hinge Dating App: Match & Date": {
        "appId": "co.hinge.app",
        "name": "Hinge Dating App: Match & Date",
        "icon": "https://play-lh.googleusercontent.com/5P5svqXNCWqE0NtHSV91pl2YUGKJ2aitjaUWIVZd-65AtskDVO2o9bpYx1oAV9fr0-nt",
        "developer": "Hinge, Inc.",
        "genre": "Dating",
        "score": 3.4619937,
        "installs": "10,000,000+",
        "summary": "Match, Flirt, Meet & Date with Intention: The Dating App Designed to be Deleted",
        "description": "Welcome to Hinge, the dating app for people who want to go on their last first date. With profiles that show your personality through text, photos, video, and voice, you have unique conversations that lead to great dates. And it’s working. Currently, people on Hinge go on a date every three seconds. Additionally, in 2022, we were the fastest-growing dating app in the US, UK, and Canada. \r\n\r\nHinge is built on the belief that anyone looking for meaningful connections should be able to find it. By inspiring intimate, in person connections, we aim to create a less lonely world. With detailed profiles, meaningful likes and a nobel-prize winning algorithm, dating & relationships are at the core of everything we do.\r\n\r\n<b>HOW WE GET YOU OFF HINGE</b>\r\nWhen it comes to online dating, people are so busy matching that they’re not always connecting, in person, where it counts. Hinge is on a mission to change that. Our goal is to help you go on your last first date, so we built Hinge, the app that’s designed to be deleted. Here’s how:\r\n\r\n💌 We quickly learn your type. Tell us your relationship type and dating preferences so that we can help introduce the best people for you.\r\n\r\n💗We give you a sense of someone’s personality. You’ll get to know potential dates through their unique answers to prompts, as well as information like religion, height, politics, dating intentions, relationship type, and much more.\r\n\r\n💘We make it easy to start a conversation. Every match begins by someone liking or commenting on a specific part of your profile.\r\n\r\n🫶We want you to feel confident about meeting people in person and going on great dates. Selfie Verification makes it easier for daters on Hinge to ensure that they are who they say they are.\r\n\r\n❤️We ask how your dates are going. After exchanging phone numbers with a Match, we’ll follow up to hear how your date went so we can make better recommendations in the future.\r\n\r\n<b>PRESS</b>\r\n◼ \"It's the go-to dating app for many people looking for love.\" - The Daily Mail\r\n◼ “Hinge’s CEO says a good dating app relies on vulnerability, not algorithms.” - Washington Post\r\n◼ \"Hinge is the first dating app to actually measure real-world success\" - TechCrunch\r\n\r\n\r\nDaters looking to see everyone who likes them or send unlimited likes can upgrade to Hinge+. To access additional features, including enhanced recommendations and priority likes, we offer HingeX.\r\n\r\n<b>SUBSCRIPTION INFO</b>\r\n➕ Payment will be charged to your selected payment method at confirmation of purchase\r\n➕ Subscription automatically renews before your next billing date unless auto-renew is turned off \r\n➕ Account will be charged for renewal at the same price and duration prior to the end of the current period\r\n➕ Subscriptions may be managed and auto-renewal may be turned off by going to Account Settings after purchase\r\n\r\nSupport: hello@hinge.co\r\nTerms of Service: https://hinge.co/terms.html\r\nPrivacy Policy: https://hinge.co/privacy.html\r\n\r\nAll photos are of models and used for illustrative purposes only.",
        "updated": 1757102367,
        "size": "",
        "version": "9.90.0",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=co.hinge.app"
      }
    },
    {
      "Candy Crush Saga": {
        "appId": "com.king.candycrushsaga",
        "name": "Candy Crush Saga",
        "icon": "https://play-lh.googleusercontent.com/TLUeelx8wcpEzf3hoqeLxPs3ai1tdGtAZTIFkNqy3gbDp1NPpNFTOzSFJDvZ9narFS0",
        "developer": "King",
        "genre": "Casual",
        "score": 4.619665,
        "installs": "1,000,000,000+",
        "summary": "Match your way through candy puzzles packed with fun and clever challenges!",
        "description": "Explore a world full of delicious match-3 puzzles and endless fun! Blast through thousands of challenging levels in this timeless puzzle game from King. Match candies, conquer jelly, toffees, and jam, and uncover sweet surprises in every puzzle.\r\n\r\nClassic Match-3 Gameplay with Fresh Twists\r\n\r\n- Discover unique game modes like Gummy Dragons and Bubblegum Pop. \r\n- Match and blast your way through matching levels full of sugar-coated fun.\r\n- Master tricky puzzles and create explosive combos to clear the board!\r\n\r\nBrain-Boosting Challenges & Special Events\r\n\r\n- Daily Rewards: Log in every day to claim free boosters and extra lives.\r\n- Time-Limited Events: Compete in themed challenges and win exclusive prizes.\r\n- Tournaments & Leaderboards: Crush more candies than your friends and rise to the top to become the ultimate match-3 master!\r\n\r\nBonbon Blitz Your Way Through Extra Sticky Levels\r\n\r\n- Use powerful boosters like Bonbon Blitz, Lollipop Hammer, and Jelly Fish to solve puzzles and boost your score.\r\n- Stuck on a level? Boosters and extra moves will help you blast through any obstacle.\r\n\r\nPlay Offline or Online, Anytime and Anywhere\r\n\r\n- No internet, no problem: Enjoy offline gameplay and keep the fun going wherever you are.\r\n- Ad-free fun means uninterrupted candy-matching bliss!\r\n\r\nConnect with Friends & Join the Candy Kingdom\r\n\r\n- Share lives, compare scores, and see who’s the match-3 master in your friends circle.\r\n- Connect your game to Facebook to sync progress, compete with friends, and unlock exclusive rewards!\r\n\r\nDiscover more from King\r\n\r\nLooking for more brain-teasing fun? Try Candy Crush Soda Saga or Farm Heroes Saga for fresh twists on classic match-3 puzzles. Or dive into sweet solitaire action with the new Candy Crush Solitaire!\r\n\r\nCandy Crush Saga is free to play, but optional in-game items require payment. You can turn off the payment feature in your device’s settings.",
        "updated": 1757348684,
        "size": "",
        "version": "1.311.1.1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.king.candycrushsaga"
      }
    },
    {
      "Bumble Dating App: Meet & Date": {
        "appId": "com.bumble.app",
        "name": "Bumble Dating App: Meet & Date",
        "icon": "https://play-lh.googleusercontent.com/7GSSxUQ2KneDsNK1KIlBa26ukNM6UmOtpfAVSj-72Im-62jd1-38et6VEqBD-LKfXZdGHQfucP3tVOIGa3kV",
        "developer": "Bumble Holding Limited",
        "genre": "Dating",
        "score": 3.8827078,
        "installs": "50,000,000+",
        "summary": "Dating app to meet new people, chat and date with singles IRL or make friends.",
        "description": "<b>The dating app bringing people closer to love</b>\r\n\r\nBumble is the dating app where people meet, make connections, and start their love stories. We believe meaningful relationships are the foundation of a happy, healthy life — and we're here to help you find yours with a commitment to member safety and tools that empower confident dating.\r\n\r\n<b>Match with the right people, date, and find meaningful connection</b>\r\n\r\nBumble is a free app for meeting singles and building connections grounded in mutual respect and trust. Whether you’re ready to find the one or date for fun, Bumble can help you connect with real people to build something authentic.\r\n\r\n<b>As champions of love, we prioritize creating a space where our members feel respected, confident, and empowered to make connections</b>\r\n\r\n💛 Our members are at the heart of everything we do\r\n💛 We put safety first — so you can date with confidence, knowing you’re connecting with verified matches\r\n💛 Respect, courage, and joy guide how we show up — and inspire others to do the same\r\n\r\n<b>Try our free features — built to make dating easier</b>\r\n- For better connections, conversations, and dates, personalize your profile with interests and prompts to showcase who you are, what you’re into, and what you’re looking for\r\n- Trust that the person you’re talking to is real with ID Verification\r\n- Feel confident with expert-backed dating advice designed to help you succeed\r\n- See what music you bond over by linking your Spotify account\r\n- Video chat and share your favorite pictures with your matches to get to know them better\r\n- Chat with peace of mind — knowing that when you’re talking to new people, all messages must meet our community guidelines\r\n- Get extra reassurance by sharing the details of your meetups with someone you trust\r\n- If you’re ever in need of a dating break, hide your profile with the Snooze Mode (you'll still keep all your matches)\r\n\r\n<b>Want even more ways to connect? Bumble Premium unlocks extra features to boost your dating experience</b>\r\n💛 See everyone who likes you\r\n🔍 Use Advanced Filters like “What are they looking for?” to meet people who share your values, hobbies, and goals\r\n🔁 Rematch with expired connections — so you don’t miss out on a great potential date\r\n😶‍🌫️  Browse anonymously with Incognito Mode and only seen by who you want to see you\r\n➕ Extend your matches by 24 hours\r\n👉 Swipe as much as you like to meet more people\r\n✈️ Tap into dating scenes around the world with Travel Mode\r\n✨ Stand out and get noticed with free SuperSwipes & Spotlights, refreshed weekly\r\n\r\n<b>Inclusivity is key</b>\r\nAt Bumble, we promise to support and include all forms of love: straight, gay, lesbian, queer, and beyond. We want everyone in our community to feel safe and welcome. So no matter how you identify, if you're looking for a place to chat, date, and find real love, we’ve got what you’re looking for.\r\n\r\n---\r\nBumble is a free dating app to download and use. We offer optional subscription packages (Bumble Boost & Bumble Premium) and non-subscription, single, and multi-use paid features (Bumble Spotlight & Bumble SuperSwipe). Your personal data is securely processed in line with our privacy policy and applicable laws—be sure to read our privacy policy and terms and conditions.\r\nhttps://bumble.com/en/privacy\r\nhttps://bumble.com/en/terms\r\nBumble Inc. is the parent company of Bumble, Badoo, and BFF, social networks, and dating apps free to download and use.",
        "updated": 1757329084,
        "size": "",
        "version": "5.433.0",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.bumble.app"
      }
    },
    {
      "Tubi: Free Movies & Live TV": {
        "appId": "com.tubitv",
        "name": "Tubi: Free Movies & Live TV",
        "icon": "https://play-lh.googleusercontent.com/3nVkWPn19cL1C1LZ8AXEtS8z3VxoWc4SIlIN75sc437oM_9hVL1vhKpAGdUtVIPLj9o",
        "developer": "Tubi TV",
        "genre": "Entertainment",
        "score": 4.8413286,
        "installs": "100,000,000+",
        "summary": "On Tubi, Movies, Shows, (and  Love) Don't Cost a Thing!",
        "description": "Nice to meet you, we’re Tubi. We’re more than a completely free streamer with the largest library in the entire streaming universe. We’re entertainment fiends and collectors, and never judgers. So, get comfy and settle into whatever you’re feeling. It’s about to get good.\r\n\r\nWATCH FREE:\r\n\r\nLive TV: news, weather, sports, & entertainment\r\nIt’s live, always on, always free and has way fewer ads than cable. We call that a win-win-win-win. \r\n+ Check your local news channels for weather and news.\r\n+ Get game day ready with pre-game excitement.\r\n+ Unwind with your favorite TV competitions and guilty pleasures.\r\n\r\nMovies\r\nFrom the biggest names in the industry to the indie darlings we can’t get enough of.\r\n+ Top titles added every month.\r\n+ Bask in loads of drama that isn’t your own.\r\n+ Comedy, action, and horror…oh, my! Whatever genre you’re looking for, we have it.\r\n\r\nSeries\r\nMarathon all the best series, all in one place, with zero subscriptions ever.\r\n+ Refine your taste buds with cooking shows and competitions.\r\n+ Get lost in the drama of an evening soap.\r\n+ Decompress with laugh-out-loud sitcoms.\r\n\r\nTubi Originals\r\nMade by us, just for you. And only available on Tubi.\r\n+ Critically acclaimed series like Boarders and Big Mood.\r\n+ Live out your fantasies with all-new reality shows, series, and movies.\r\n\r\nTubi Comic Con(tent)\r\nIt's a bird, it's a plane, it's...all your favorite comic book heroes and caped crusaders!\r\n+ Binge full series, old school and new.\r\n+ Stay current with the latest Hollywood releases.\r\n\r\nTubi Español\r\nTú perteneces aquí. Watch in Spanish with no subtitles necessary.\r\n+ Keep up with all your telenovelas.\r\n+ Stream Spanish-first favorites and discover dubbed blockbusters.\r\n\r\nInternational Entertainment\r\n+ Ikuze! We have all the anime!\r\n+ Korea’s in the house!! Get your fill of K-pop, horror, action, comedy, and drama.\r\n+ Live the Bollywood dream and dance along with tons of favorites.\r\n\r\nMORE PERKS\r\n+ Swipe your way to discovering new content.\r\n+ Never run out of stuff to watch. We add new arrivals every week.\r\n+ Here, there, everywhere. Tubi works on 30+ devices, so it goes wherever you go.\r\n+ We’ll never ask for your credit card, ever. It’s free forever. For really.\r\n+ Create an account to build your own watchlist, save your watch progress, and get better recommendations.\r\n\r\nSee You In There™",
        "updated": 1757699897,
        "size": "",
        "version": "Varies with device",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.tubitv"
      }
    }
  ],
  "TOP_GROSSING": [
    {
      "Google One": {
        "appId": "com.google.android.apps.subscriptions.red",
        "name": "Google One",
        "icon": "https://play-lh.googleusercontent.com/B5AENJqFOd91t5cWZLTQbVUm7iDWzYVM1n0Pe2RI_46dhlWMtVAUBioUvy4YMXWdwA",
        "developer": "Google LLC",
        "genre": "Productivity",
        "score": 4.1502023,
        "installs": "1,000,000,000+",
        "summary": "Cloud storage, automatic phone backup, and more.",
        "description": "The Google One app lets you automatically back up your phone and manage your Google cloud storage.\r\n  • Automatically back up the important things on your phone, like photos, contacts and messages using your 15 GB of storage that comes with every Google account. If you break, lose or upgrade your phone, you can restore everything to your new Android device.\r\n  • Manage your existing Google account storage across Google Drive, Gmail and Google Photos.\r\n\r\n  Upgrade to a Google One membership to get even more:\r\n  • Get as much storage as you need for your important memories, projects and digital files. Choose the plan that works best for you.",
        "updated": 1757623696,
        "size": "",
        "version": "Varies with device",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.google.android.apps.subscriptions.red"
      }
    },
    {
      "Disney+": {
        "appId": "com.disney.disneyplus",
        "name": "Disney+",
        "icon": "https://play-lh.googleusercontent.com/gXHdyj_9Dbyz3uJy1EnmLHMUpU33VeD0n6kObv6tzvBveWKDFZQt7yGrnM-L4FW-5P4",
        "developer": "Disney",
        "genre": "Entertainment",
        "score": 4.3987107,
        "installs": "100,000,000+",
        "summary": "Stream and download your favorite movies, TV shows & Originals on Disney+",
        "description": "Disney+ is the streaming home of your favorite stories. With beloved movies and series from Disney, Pixar, Marvel, Star Wars, National Geographic, there's always something to explore. Stream the latest movie releases, exclusive Original series, and highly anticipated matchups all in Disney+.\r\n\r\n\r\nStream Originals like Marvel Studios’ Loki and fan favorites like Encanto and The Simpsons.\r\n\r\nWith a Disney+ subscription plan you will get to experience:\r\n• Exclusive new Originals from Disney, Pixar, Marvel, Star Wars, and National Geographic.\r\n• Access to new releases, timeless classics, and past seasons of your favorite TV shows.\r\n•A live feed of ABC News and Streams that offer carefully curated, continuous programming based on seasonality or interest, from across the Disney+ library*\r\n• Over 100 titles in 4K UHD and HDR.\r\n• The ability to watch on multiple screens at once at no extra cost.\r\n• Multiple parental control features including Profile PIN and Kid-Proof Exit. Easily adjust a profile’s Content Rating settings for a viewing experience that suits everyone\r\n• IMAX Enhanced, see the full scale and scope with IMAX's expanded aspect ratio. Available with certain Marvel and Pixar titles and accessible on all devices where Disney+ is supported.\r\n• A curated selection of unlocked Hulu content in the Hulu hub within the Disney+ app.**\r\n• A curated selection of highly anticipated live sports events, ESPN Originals, and studio programming in the ESPN hub within the Disney+ app**\r\n\r\nFor help with Disney+, please visit: http://help.disneyplus.com\r\nFor our Subscriber Agreement and other policies please visit: https://disneyplus.com/legal/subscriber-agreement\r\nYour California Privacy Rights: https://www.disneyplus.com/legal/your-california-privacy-rights\r\nDo Not Sell My Information: https://www.disneyplus.com/legal/privacy-policy\r\n\r\nThe content available on Disney+ may vary by region. Some titles shown above may not be available in your country.\r\n\r\n*Select Streams are currently available only with the Disney+ Premium plan. ABC News is not rated and will require a profile's Content Rating settings to be set to TV-MA. All other Streams are rated on a program-by-program basis.\r\n\r\n**Content subject to change. U.S. residents, 18+ only. A limited selection of content from Hulu and ESPN are now available to all Disney+ subscribers. To access the full ESPN on Disney+ and Hulu on Disney+ experiences, you must bundle those services with your Disney+ subscription.",
        "updated": 1757438360,
        "size": "",
        "version": "4.14.0+rc3-2025.08.22",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.disney.disneyplus"
      }
    },
    {
      "Gardenscapes": {
        "appId": "com.playrix.gardenscapes",
        "name": "Gardenscapes",
        "icon": "https://play-lh.googleusercontent.com/MI0aupX4o-83J3FhZILVyrl7WMnBVF9AiMghexepstdhSV6JnaTMgd18YvuFuFdKxBU",
        "developer": "Playrix",
        "genre": "Casual",
        "score": 4.7592826,
        "installs": "500,000,000+",
        "summary": "Create your own garden and solve match-3 puzzles in this redesign game!",
        "description": "Welcome to Gardenscapes, the first game from the Playrix Scapes™ series! Make match-3 combinations and bring coziness and beauty to every corner of your garden.\r\n\r\nSolve fun puzzles, restore and explore new areas of the garden, and meet new friends in every chapter of the exciting storyline. Austin the butler is ready to welcome you to a world of incredible adventures!\r\n\r\nGame Features:\r\n● Gameplay loved by millions of players! Make match-3 combinations and decorate your garden while enjoying an entertaining story!\r\n● Over 16,000 captivating levels with explosive power-ups, useful boosters, and cool elements.\r\n● Exciting events! Embark on fascinating Expeditions, compete against other players in different challenges, and win awesome prizes!\r\n● One-of-a-kind garden areas with unique layouts, from fountain ensembles to island landscapes.\r\n● Loads of fun characters: meet Austin's friends and neighbors!\r\n● Adorable pets that will become your faithful companions!\r\n\r\nPlay with your Facebook friends, or make new friends in the game community!\r\n\r\nGardenscapes is free to play, but some in-game items can be purchased for real money. \r\n\r\nA Wi-Fi or internet connection is not required to play.\r\n *An internet connection is required to access competitions and additional features.\r\n\r\nDo you like Gardenscapes? Follow us!\r\nFacebook: https://www.facebook.com/Gardenscapes\r\nInstagram: https://www.instagram.com/gardenscapes_mobile/\r\n\r\nNeed to report an issue or ask a question? Contact Player Support through the game by going to Settings > Help and Support. If you can't access the game, use the web chat by clicking the chat icon in the lower right corner of our website: https://playrix.helpshift.com/hc/en/5-gardenscapes/\r\n\r\nTerms of Use: https://playrix.com/terms/index_en.html\r\n\r\nPrivacy Policy: https://playrix.com/privacy/index_en.html",
        "updated": 1757590487,
        "size": "",
        "version": "9.0.0",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.playrix.gardenscapes"
      }
    },
    {
      "Toon Blast": {
        "appId": "net.peakgames.toonblast",
        "name": "Toon Blast",
        "icon": "https://play-lh.googleusercontent.com/gtbXJIRh-y3vS3885bqy-4y8noqfzFym7Ep47eoZuZs_6wd5lc4L0_sWp66lMmD7Olw",
        "developer": "Peak",
        "genre": "Puzzle",
        "score": 4.6275096,
        "installs": "100,000,000+",
        "summary": "Welcome to the funniest cartoon puzzle adventure!",
        "description": "From the creators of Toy Blast comes the ultimate puzzle game with unique gameplay and endless fun!\r\n\r\nEnter the crazy cartoon world starring Cooper Cat, Wally Wolf, Bruno Bear and enjoy loads of whacky and challenging levels! Blast cubes and create powerful combos to pass levels. Solve puzzles to help the Toon gang as they travel around magical worlds! \r\n\r\nJoin the wildest adventure of your life and have a BLAST!\r\n\r\nFEATURES:\r\n\r\n● Complete tons of challenging levels and unlock new episodes!\r\n● Play with unique game objectives and dozens of entertaining obstacles!\r\n● Unlock whacky boosters to blast your way to the next level!\r\n● Collect stars by completing levels to win awesome rewards!\r\n● Create your own team & compete with others to rule the puzzle world! \r\n● Receive lives from your teammates to keep on playing! \r\n● Sync your game easily between your phone and tablet!\r\n● Easy and fun to play yet challenging to master!",
        "updated": 1756802390,
        "size": "",
        "version": "19084",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=net.peakgames.toonblast"
      }
    },
    {
      "Royal Kingdom": {
        "appId": "com.dreamgames.royalkingdom",
        "name": "Royal Kingdom",
        "icon": "https://play-lh.googleusercontent.com/nAAF2bxrD2BeoM1IkUZ6qeRG_QGG_Rekrrh4VYQSMDeRa7FR8sWMWaHClID547XJ3D4",
        "developer": "Dream Games, Ltd.",
        "genre": "Puzzle",
        "score": 4.6176534,
        "installs": "10,000,000+",
        "summary": "Get ready to be a part of King Richard's glorious match 3 puzzle adventure!",
        "description": "From the creators of Royal Match comes a brand new match 3 puzzle adventure in Royal Kingdom, starring the extended Royal Family!\r\n\r\nYou’ll meet King Richard, King Robert's younger brother, as well as a charming cast of new characters, including Princess Bella and the Wizard, to embark on a journey to build legendary kingdoms! Solve match 3 puzzles to explore new lands and defeat the Dark King & his army!\r\n\r\nMASTER MATCH 3 PUZZLES\r\nTest your skills and become the ultimate match 3 expert by solving fun yet challenging puzzles! Beat thrilling levels and overcome unique obstacles!\r\n\r\nBUILD AND EXPLORE KINGDOMS\r\nWith the help of the Builder, craft a kingdom befitting royalty. Solve puzzles, earn coins, and unlock diverse districts - from the Parliament Square to the University and the Princess Tower.\r\n\r\nCONQUER THE DARK KING\r\nDefend the kingdom from the Dark King’s attack by solving match 3 puzzles - destroy his castles and evil minions to see him fall. Victory is one match away!\r\n\r\nEXPAND YOUR RULING\r\nRise through the ranks and claim the top spot on the leaderboard, master your puzzle solving skills for generous rewards, and expand your kingdom by uncovering uncharted lands as you play!\r\n\r\nENJOY THE FINEST VISUALS\r\nImmerse yourself in Royal Kingdom's stunning graphics and smooth animations. A puzzle game experience like never before - captivating and seamless.\r\n\r\nWhat are you waiting for? Download Royal Kingdom and join the ranks of the noble adventurers! With hours of fun, challenging gameplay, and a magical world, this puzzle game is fit for royalty!",
        "updated": 1757106675,
        "size": "",
        "version": "21310",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.dreamgames.royalkingdom"
      }
    }
  ],
  "NEW_FREE": [
    {
      "Instagram": {
        "appId": "com.instagram.android",
        "name": "Instagram",
        "icon": "https://play-lh.googleusercontent.com/VRMWkE5p3CkWhJs6nv-9ZsLAs1QOg5ob1_3qg-rckwYW7yp1fMrYZqnEFpk0IoVP4LM",
        "developer": "Instagram",
        "genre": "Social",
        "score": 3.943279,
        "installs": "5,000,000,000+",
        "summary": "Create & share photos, stories, & reels with friends you love",
        "description": "Little moments lead to big friendships. Share yours on Instagram. \r\n—From Meta\r\n\r\nConnect with friends, find other fans, and see what people around you are up to and into. Explore your interests and post what's going on, from your daily moments to life's highlights.\r\n\r\nShare what you’re up to and into on Insta®.\r\n- Keep up with friends on the fly with Stories and Notes that disappear after 24 hours.\r\n- Start group chats and share unfiltered moments with your Close Friends.\r\n- Share memories from recent events or trips in Feed.\r\n- Turn your life into a movie and discover short, entertaining videos on Instagram with Reels.\r\n- Customize your posts with exclusive templates, music, stickers and filters.\r\n\r\nDive into your interests.\r\n- Watch videos from your favorite Creators and discover new content that’s personalized to your interests.\r\n- Get inspired by photos and videos from new accounts in Explore.\r\n- Discover brands and small businesses, and shop products that are relevant to your personal style.\r\n\r\nSome Instagram features may not be available in your country or region.\r\n\r\nTerms and Policies - https://help.instagram.com/581066165581870\r\n\r\nConsumer Health Privacy Policy: https://privacycenter.instagram.com/policies/health\r\n\r\nLearn how we're working to help keep our communities safe across Meta technologies at the Instagram Safety Center: https://about.instagram.com/safety",
        "updated": 1757695783,
        "size": "",
        "version": "Varies with device",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.instagram.android"
      }
    },
    {
      "Free Fire x NARUTO SHIPPUDEN": {
        "appId": "com.dts.freefireth",
        "name": "Free Fire x NARUTO SHIPPUDEN",
        "icon": "https://play-lh.googleusercontent.com/jHnf_3-yMox_Tub_oLKQ7OuOi8Iahf1f4rdu-etZ2hmzUOekY84znct-c8hksxhD15PYNk4dMH2ZdVY3uxm7Gw",
        "developer": "Garena International I",
        "genre": "Action",
        "score": 4.245672,
        "installs": "1,000,000,000+",
        "summary": "10-minute Survival Shooter!",
        "description": "The Free Fire x NARUTO SHIPPUDEN Collaboration Chapter 2 is now live!\r\n\r\nThe Akatsuki have launched a surprise attack on the Hidden Leaf Village! Join forces with the Hidden Leaf ninjas to repel the invasion and protect your ninja world!\r\n\r\n[Tsukuyomi]\r\nAll maps are affected by Tsukuyomi. Enter the affected zones to discover hidden ninjutsu and ninja tools, uncovering more secrets of the ninja world!\r\n\r\n[Akatsuki Keepsake]\r\nNew Akatsuki keepsakes have arrived! Each keepsake holds iconic combat abilities from the original story, letting you relive thrilling battles and experience authentic ninja powers!\r\n\r\n[Hidden Leaf Village in Ruins]\r\nThe Hidden Leaf Village is under a fierce Akatsuki assault! Pain Tendo looms high above, unleashing the devastating Planetary Devastation. The Hidden Leaf ninjas need your help! Grab your weapons, join the fight, and save the village!\r\n\r\nFree Fire is a world-famous survival shooter game available on mobile. Each 10-minute game places you on a remote island where you are pit against 49 other players, all seeking survival. Players freely choose their starting point with their parachute, and aim to stay in the safe zone for as long as possible. Drive vehicles to explore the vast map, hide in the wild, or become invisible by proning under grass or rifts. Ambush, snipe, survive, there is only one goal: to survive and answer the call of duty.\r\n\r\nFree Fire, Battle In Style!\r\n\r\n[Survival shooter in its original form]\r\nSearch for weapons, stay in the play zone, loot your enemies and become the last man standing. Along the way, go for legendary airdrops while avoiding airstrikes to gain that little edge against other players.\r\n\r\n[10 minutes, 50 players, epic survival goodness awaits]\r\nFast and Lite gameplay - Within 10 minutes, a new survivor will emerge. Will you go beyond the call of duty and be the one under the shining lite?\r\n\r\n[4-man squad, with in-game voice chat]\r\nCreate squads of up to 4 players and establish communication with your squad at the very first moment. Answer the call of duty and lead your friends to victory and be the last team standing at the apex.\r\n\r\n[Clash Squad]\r\nA fast paced 4v4 game mode! Manage your economy, purchase weapons, and defeat the enemy squad!\r\n\r\n[Realistic and smooth graphics]\r\nEasy to use controls and smooth graphics promises the optimum survival experience you will find on mobile to help you immortalize your name among the legends. \r\n\r\n[Contact us]\r\nCustomer Service: https://ffsupport.garena.com/hc/en-us",
        "updated": 1753340945,
        "size": "",
        "version": "1.114.1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.dts.freefireth"
      }
    },
    {
      "Candy Crush Saga": {
        "appId": "com.king.candycrushsaga",
        "name": "Candy Crush Saga",
        "icon": "https://play-lh.googleusercontent.com/TLUeelx8wcpEzf3hoqeLxPs3ai1tdGtAZTIFkNqy3gbDp1NPpNFTOzSFJDvZ9narFS0",
        "developer": "King",
        "genre": "Casual",
        "score": 4.619665,
        "installs": "1,000,000,000+",
        "summary": "Match your way through candy puzzles packed with fun and clever challenges!",
        "description": "Explore a world full of delicious match-3 puzzles and endless fun! Blast through thousands of challenging levels in this timeless puzzle game from King. Match candies, conquer jelly, toffees, and jam, and uncover sweet surprises in every puzzle.\r\n\r\nClassic Match-3 Gameplay with Fresh Twists\r\n\r\n- Discover unique game modes like Gummy Dragons and Bubblegum Pop. \r\n- Match and blast your way through matching levels full of sugar-coated fun.\r\n- Master tricky puzzles and create explosive combos to clear the board!\r\n\r\nBrain-Boosting Challenges & Special Events\r\n\r\n- Daily Rewards: Log in every day to claim free boosters and extra lives.\r\n- Time-Limited Events: Compete in themed challenges and win exclusive prizes.\r\n- Tournaments & Leaderboards: Crush more candies than your friends and rise to the top to become the ultimate match-3 master!\r\n\r\nBonbon Blitz Your Way Through Extra Sticky Levels\r\n\r\n- Use powerful boosters like Bonbon Blitz, Lollipop Hammer, and Jelly Fish to solve puzzles and boost your score.\r\n- Stuck on a level? Boosters and extra moves will help you blast through any obstacle.\r\n\r\nPlay Offline or Online, Anytime and Anywhere\r\n\r\n- No internet, no problem: Enjoy offline gameplay and keep the fun going wherever you are.\r\n- Ad-free fun means uninterrupted candy-matching bliss!\r\n\r\nConnect with Friends & Join the Candy Kingdom\r\n\r\n- Share lives, compare scores, and see who’s the match-3 master in your friends circle.\r\n- Connect your game to Facebook to sync progress, compete with friends, and unlock exclusive rewards!\r\n\r\nDiscover more from King\r\n\r\nLooking for more brain-teasing fun? Try Candy Crush Soda Saga or Farm Heroes Saga for fresh twists on classic match-3 puzzles. Or dive into sweet solitaire action with the new Candy Crush Solitaire!\r\n\r\nCandy Crush Saga is free to play, but optional in-game items require payment. You can turn off the payment feature in your device’s settings.",
        "updated": 1757348684,
        "size": "",
        "version": "1.311.1.1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.king.candycrushsaga"
      }
    },
    {
      "PUBG MOBILE": {
        "appId": "com.tencent.ig",
        "name": "PUBG MOBILE",
        "icon": "https://play-lh.googleusercontent.com/zCSGnBtZk0Lmp1BAbyaZfLktDzHmC6oke67qzz3G1lBegAF2asyt5KzXOJ2PVdHDYkU",
        "developer": "Level Infinite",
        "genre": "Action",
        "score": 4.31963,
        "installs": "500,000,000+",
        "summary": "Choice of Over 1 Billion Players! Ultimate Battle Royale On Mobile！",
        "description": "【Epic battle royale masterpiece】\r\nLots of events for you to explore.Climb to the top in PUBG MOBILE and fire at will. PUBG MOBILE is the original battle royale game on mobile and one of the best mobile shooting games.\r\n\r\n【Extreme battles in 10-minute matches】\r\nPrepare your firearms, respond to the call for battle in PUBG MOBILE, and fire at will.\r\n\r\n【Tons of maps and modes】\r\nPUBG MOBILE has many maps and gameplay mechanics that give you a thrilling survival experience. Find your friends and play the new modes together! Play however you like and fire at will!\r\n\r\n【Play anytime, anywhere】\r\nRelax and play PUBG MOBILE to your heart's content! Enjoy the smoothest gunplay for an unparalleled gameplay experience.Feel the call of duty, move forward with courage, and lead your friends to victory\r\n\r\n【Made especially for mobile phones】\r\nFeatures customizable controls, training mode, and voice chat with friends. Experience the smoothest control experience and the most realistic firearms on your phone.\r\n\r\nPUBG MOBILE has the highest fidelity items and gameplay experience. PUBG MOBILE can fulfill any wish you might have. Choose from countless firearms and test your marksmanship. New items, maps, and modes are constantly being added to the game.\r\n\r\nPUBG MOBILE offers the most intense multiplayer battles on your mobile phone. Join the battle, gear up, and play to win. Survive in epic 100-player battles in Classic Mode, Payload , fast-paced 4v4 Arena battles, and Infection Mode. Survival is all that matters. Be the last one standing. Accept missions and fire at will!\r\n\r\n【Follow us】\r\nInstagram: https://www.instagram.com/pubgmobile\r\nFacebook: https://www.facebook.com/PUBGMOBILE\r\nTwitter: https://twitter.com/PUBGMobile\r\nYoutube: https://www.youtube.com/pubgmobile\r\nTiktok: https://www.tiktok.com/@pubgmobile\r\nReddit: https://www.reddit.com/r/PUBGMobile/\r\nDiscord: https://discord.gg/pubgmobile\r\nPlease contact customer service if you encounter any problems: service@pubgmobile.com\r\n\r\nPlease read PUBG MOBILE's Privacy Policy and User Agreement\r\nPrivacy Policy: http://pubgmobile.proximabeta.com/privacy.html\r\nTencent Games User Agreement: https://www.pubgmobile.com/terms.html",
        "updated": 1756288095,
        "size": "",
        "version": "4.0.0",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.tencent.ig"
      }
    },
    {
      "Call of Duty: Mobile Season 8": {
        "appId": "com.activision.callofduty.shooter",
        "name": "Call of Duty: Mobile Season 8",
        "icon": "https://play-lh.googleusercontent.com/GBaWlaevq4CA0xN13QYlIseEmL2inzVEx9z3HBBJPNbIQmlZLgA9lj-pfbY4h3XVa5Xvuns3ORaWSEvk8IbSDyQ",
        "developer": "Activision Publishing, Inc.",
        "genre": "Action",
        "score": 4.271749,
        "installs": "100,000,000+",
        "summary": "Realistic action-packed FPS Battle Royale & 5v5 war multiplayer. Lock and load!",
        "description": "CALL OF DUTY® like never before, bringing fast-paced FPS action to your fingertips.\r\n\r\nJump into intense Multiplayer battles with classic modes like Team Deathmatch, Domination, and Kill Confirmed on legendary maps such as Shipment, Raid, and Standoff. Prefer Battle Royale? Squad up and conquer with dynamic modes like Tank Isolated and Training Ground, set in iconic battlegrounds.\r\n\r\nBattle Royale chaos awaits! Explore all 5 POIs, fight to survive, and claim victory. Or, team up with friends for action-packed Multiplayer matches on fan-favorite maps like Nuketown.\r\n\r\nJoin millions of players and dominate the battlefield in CALL OF DUTY®: MOBILE—the ultimate free-to-play FPS experience. Whether it’s fast 5v5 team deathmatches, epic Zombies mode, or all-out Battle Royale warfare, the action never stops.\r\n\r\nLock and load—your next mission starts now!\r\n\r\nDOWNLOAD FOR FREE TODAY\r\nCALL OF DUTY®: MOBILE boasts console quality HD gaming on your phone with customizable and intuitive controls, voice and text chat with your friends, and thrilling 3D graphics and sound. Enjoy controller games? We got you! Experience this iconic FPS franchise, on the go. Play this FPS gun game anywhere. Every mission feels like a high-stakes delta operation, pushing your shooting skills to the limit.\r\n\r\nNEW SEASONAL CONTENT UPDATED MONTHLY\r\nCALL OF DUTY®: MOBILE has a variety of FPS game modes, maps, themed events, and rewards so it never gets old. Every season expands upon the story in the CALL OF DUTY® universe and brings new & unique unlockable content. Jump into battle royale today!\r\n\r\nCUSTOMIZE YOUR UNIQUE LOADOUT\r\nUnlock and earn dozens of iconic operators, weapons, outfits, score streaks, and new pieces of gear, allowing you to play CALL OF DUTY®: MOBILE your way.\r\n\r\nCOMPETITIVE AND SOCIAL PLAY\r\nFan of war multiplayer games? Gather your friends and test your mettle in competitive ranked mode or sharpen your aim in social play. Join a clan for a sense of community and earn unique rewards for participating in Clan Wars. With every encounter, experience the sheer force of this legendary FPS shooter game.\r\n\r\nDOWNLOAD OPTIONS TO REDUCE APP SIZE\r\nDownload and play CALL OF DUTY®: MOBILE without the barrier of storage space. As part of an effort to make CALL OF DUTY®: MOBILE more accessible, the initial app download size has been reduced and additional options allow players to choose what is downloaded to experience the full game, such as HD resources, maps, weapons, and operators.\r\n\r\nHave what it takes to compete with the best? Download CALL OF DUTY®: MOBILE now!\r\n_________________________________________________________\r\nNOTE: We welcome any feedback during your experience to improve the game. To give feedback, in-game go to > Settings > Feedback > Contact Us.\r\nSubscribe for Updates! ---> profile.callofduty.com/cod/registerMobileGame\r\n_________________________________________________________\r\nNote: An internet connection is required to play this game.\r\n\r\nPlease note this app contains social features that allow you to connect and play with friends and push notifications to inform you when exciting events or new content are taking place in the game. You can choose whether or not to utilize these features.\r\n\r\n© 2025 Activision Publishing, Inc. ACTIVISION, and CALL OF DUTY are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the property of their respective owners. By downloading, installing or using this App, you agree to Activision's privacy policy and terms of use, as may be updated by Activision from time to time. Please visit http://www.activision.com/privacy/en/privacy.html to view Activision's privacy policy and https://www.activision.com/legal/terms-of-use to view Activision's terms of use.",
        "updated": 1753388234,
        "size": "",
        "version": "1.0.52",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.activision.callofduty.shooter"
      }
    }
  ],
  "HOT": [
    {
      "Trending Viral Music Charts": {
        "appId": "me.spotytube.spotytube",
        "name": "Trending Viral Music Charts",
        "icon": "https://play-lh.googleusercontent.com/kApm9vDP3hwMnpx7LlguGhzAu0WbFeBNGgzlyy2QdPRcxHhAsxxgboESNcQCpEjXd6I",
        "developer": "Charana Studio",
        "genre": "Music & Audio",
        "score": 4.1287127,
        "installs": "500,000+",
        "summary": "Your one stop app for the latest Music charts from around the world!",
        "description": "Your one stop app for the latest Music charts from around the world!\r\n\r\n<b>We're on a mission to collate trending and viral Music charts from around the world, all in one place</b>\r\n\r\n<b>Features</b>\r\n- Trending Music Charts from around the world\r\n- Trending Music Charts by countries\r\n- New Releases Charts very Friday\r\n- Music by Genres and Moods\r\n- Handsfree Voice Search\r\n- Import playlist from Spotify\r\n- Open playlist/track/artist in Spotify\r\n- Open playlist/track in YouTube\r\n- Create your own Playlist\r\n- Follow Playlist and Artist\r\n- Sync Playlist on multiple devices\r\n- Bluetooth music control support for cars & other bluetooth speakers\r\n\r\nWe love Music as much as you do, enjoy all the beautiful Music and spread the love ❤️ by sharing the app with friends and family. Bob Marley once said <b><i>\" One good thing about music, when it hits you, you feel no pain \"</i></b>\r\n\r\n<b>🎼 Note</b>\r\n- SpotyTube cannot play music in background or while screen is locked(YouTube Policy)\r\n- SpotyTube may require YouTube app to function correctly\r\n\r\n<b>Permission</b>\r\nYour privacy is our concern, that's why SpotyTube does not require any app permission other than Internet permission, which is required to stream Music\r\n\r\nTrademark Legal Notice\r\nSpotify©, YouTube©, Billboard©, Deezer,© Pandora©, SoundCloud©, Apple Music©, Amazon Music©, Google Music© are all registered trademark of the respective companies/owners. All company, product and service names used in SpotyTube are for identification purposes only. Use of these names, and brands does not imply endorsement.",
        "updated": 1756381233,
        "size": "",
        "version": "2.20",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=me.spotytube.spotytube"
      }
    },
    {
      "Trending": {
        "appId": "com.ryza.trending",
        "name": "Trending",
        "icon": "https://play-lh.googleusercontent.com/ImFnX7BjhYqLoRBsyFw7NDgJk0wxbencXm8gAyfY5Ggb6Bwbz6jrmCimhrkc4W5Z-xA",
        "developer": "RYZA",
        "genre": "Entertainment",
        "score": null,
        "installs": "100+",
        "summary": "An app to view trending songs and artists worldwide",
        "description": "An engaging mobile application designed to keep users connected with the latest trends in the music world. The app provides a curated experience for discovering trending songs and artists across the globe. Users can explore top charts, view artist profiles, and listen to song previews, all in one seamless interface. With real-time updates, the app ensures users are always in sync with what's hot in music, offering personalized recommendations based on listening preferences. It also features a social aspect, allowing users to share their favorite tracks and playlists with friends, fostering a vibrant music-loving community.",
        "updated": 1738666661,
        "size": "",
        "version": "6.0.0+1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.ryza.trending"
      }
    },
    {
      "Trending": {
        "appId": "com.mordevs.trends",
        "name": "Trending",
        "icon": "https://play-lh.googleusercontent.com/RPMp92aYcviH4eHRc_qQ-ypvKhhspyK3XEucJaoht8hs-Znf3VB8xvk5g3_-qjkqsA",
        "developer": "mordevs",
        "genre": "Social",
        "score": 0,
        "installs": "5,000+",
        "summary": "See wath's trending in Youtube on other countries",
        "description": "Navigate global YouTube trends seamlessly! Our app allows you to switch countries and explore the latest trending videos worldwide with ease.",
        "updated": 1702655337,
        "size": "",
        "version": "1.2.4",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.mordevs.trends"
      }
    },
    {
      "Trending - The Everything App": {
        "appId": "com.anandroid.trending",
        "name": "Trending - The Everything App",
        "icon": "https://play-lh.googleusercontent.com/9hsu_i3HM1ir7BxnuhopyABApO2vlGm9VMbghDBGQo6mmH5LCxb2_d64Di-3L3x4mik",
        "developer": "Anandroid Inc.",
        "genre": "Social",
        "score": 3.7857144,
        "installs": "50,000+",
        "summary": "If its Trending, Viral, Most Searched, Read & Liked or Just In News,\nWe have it.",
        "description": "Ever wondered what's the world up to right now?\r\nIf the answer is yes, then this is the app for you.\r\n\r\nGoogle, Youtube, Reddit, Twitter, Wikipedia and News trends in one app.\r\n\r\nKeep up with fastest rising Google searches, viral Youtube videos, top and hot Reddit posts, trending Twitter hashtags and tweets, top and latest news from 70+ news sources and most read Wikipedia articles.\r\nGet worldwide trending searches, videos, reddit posts, news, hashtags and wiki articles at your fingertips.\r\n\r\nUse widget to add trending to your home screen and check whats trending in the world without even opening the app. Check below how to add Trending widget to your home screen.\r\n\r\nSearches\r\n\t▪\tTrack fastest rising searches from Google trends.\r\n\t▪\tTrending topics with images, news snippet and search count. \r\n\t▪\tGet trending topic details from multiple news sources.\r\n\r\nVideos\r\n\t▪\tKnow what the whole world is watching right now from YouTube trends.\r\n\t▪\tWatch viral videos right from the app.\r\n\r\nReddit\r\n\t▪\tEnjoy whatever’s trending on Reddit.\r\n\t▪\tGet Top, Hot and Controversial reddit posts of all kinds - images, gifs, videos or articles\r\n\t▪\tRead all the posts comments - thats where the actual fun is.\r\n\t▪\tSave your favourite images to your phone.\r\n\r\nNews\r\n\t▪\tRead news from 70+ news sources.\r\n\t▪\tNews from Politics, Technology, Business, Entertainment, Sport and much more.\r\n\r\nTweets\r\n\t▪\tGet more realtime Trending hashtags with Twitter. \r\n\t▪\tGet to know whats trending now on twitter not just in your Country but your neighbourhood too. \r\n\t▪\tRead all the tweets from your favourite celebrities to anyone who recently posted about it. \r\n\t▪\tSave tweeted images you love to your phone.\r\n\r\nArticles\r\n\t▪\tRead what the world is reading on the biggest Encyclopaedia in the world - Wikipedia.\r\n\t▪\tGet all the currently trending Wikipedia articles from the world.\r\n\r\nSupports over 60 countries.\r\n\r\n** How to add Trending widget to your Home screen **\r\n\r\n- First, touch and hold an open space on your home screen. You’ll see an option at the bottom of the screen to view the widgets drawer, which is where they dwell until summoned for duty.\r\n- Select widget and drag and drop Trending icon from the list of widgets to your home screen.\r\n- Thats it, Trending widget can take as small as a postage-stamp-size piece of your Home screen real estate or can be resized to cover the full screen.\r\n- Click the refresh button to load the latest trending topics around the world. Tap on the tool bar to open trending app to check more about the trends.",
        "updated": 1744574635,
        "size": "",
        "version": "6.0.3",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.anandroid.trending"
      }
    },
    {
      "Threads": {
        "appId": "com.instagram.barcelona",
        "name": "Threads",
        "icon": "https://play-lh.googleusercontent.com/G6jK9S77RN0laf9_6nhDo3AVxbRP9SgMmt8ZmQjKQ2hibn9xhOY-W5YFn_7stJD1CA",
        "developer": "Instagram",
        "genre": "Social",
        "score": 3.9918506,
        "installs": "100,000,000+",
        "summary": "Connect and share ideas",
        "description": "Say more with Threads — Instagram’s text-based conversation app.\r\n\r\nThreads is where communities come together to discuss everything from the topics you care about today to what’ll be trending tomorrow. Whatever it is you’re interested in, you can follow and connect directly with your favorite creators and others who love the same things — or build a loyal following of your own to share your ideas, opinions and creativity with the world.\r\n\r\nA few things you can do on Threads…\r\n\r\n■ Access your Instagram followers\r\nYour Instagram username and verification badge are reserved for you. Automatically follow the same accounts you follow on Instagram in a few taps, and discover new accounts too.\r\n\r\n■ Share your point of view\r\nSpin up a new thread to express what's on your mind. This is your space to be yourself, and you control who can reply.\r\n\r\n■ Connect with friends and your favorite creators\r\nJump to the replies to get in on the action and react to commentary, humor and insight from the creators you know and love. Find your community and connect with people who care about whatever it is you’re interested in.\r\n\r\n■ Control the conversation\r\nCustomize your settings and use controls to manage who can see your content, reply to your threads, or mention you. Accounts you’ve blocked will carry over from Instagram, and we’re enforcing the same Community Guidelines to help ensure everyone interacts safely and authentically. \r\n\r\n■ Find ideas and inspiration\r\nFrom TV recommendations to career advice, get answers to your questions or learn something new from crowd-sourced conversations, thought leaders and industry experts.\r\n\r\n■ Never miss a moment\r\nStay on top of the latest trends and live events. Whether it’s about new music, movie premieres, sports, games, TV shows, fashion, or the latest product releases, find discussions and receive notifications any time your favorite profiles start a new thread.\r\n\r\n■ Leap into the fediverse\r\nThreads is part of the fediverse, a global, open, social network of independent servers operated by third parties around the world. Servers share information with each other to enable people to connect and discover new things across the fediverse.\r\n\r\n\r\nMeta Terms: https://www.facebook.com/terms.php\r\nThreads Supplemental Terms: https://help.instagram.com/769983657850450\r\nMeta Privacy Policy: https://privacycenter.instagram.com/policy\r\nThreads Supplemental Privacy Policy: https://help.instagram.com/515230437301944\r\nInstagram Community Guidelines: https://help.instagram.com/477434105621119\r\nConsumer Health Privacy Policy: https://privacycenter.instagram.com/policies/health\r\n\r\nLearn how we're working to help keep our communities safe across Meta technologies at the Meta Safety Center: https://about.meta.com/actions/safety",
        "updated": 1757345747,
        "size": "",
        "version": "396.0.0.46.243",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.instagram.barcelona"
      }
    }
  ],
  "GAMES": [
    {
      "Google Play Games": {
        "appId": "com.google.android.play.games",
        "name": "Google Play Games",
        "icon": "https://play-lh.googleusercontent.com/wpRQkfqbkPztp1US6HDr8E41We8GyY-B4CG1PMmWI3WKDk9OeYh4ehXwKIfZB7dm-sc",
        "developer": "Google LLC",
        "genre": "Entertainment",
        "score": 4.031387,
        "installs": "5,000,000,000+",
        "summary": "Play games instantly, save progress, and earn achievements.",
        "description": "Games are more fun with the Google Play Games app. We'll help you find your next favorite game – from action to puzzles. And with \"Instant play,\" many games require no installation. Really. Save your progress and track your achievements as you level up. Plus, you can pick up where you left off from any device.\r\n\r\nKEY FEATURES\r\n• <b>Instant play:</b> There’s no installation needed – look for the \"Instant play\" button to instantly play full games.\r\n• <b>Built-in Google games:</b> Play Solitaire, Minesweeper, Snake, PAC-MAN, Cricket, and Whirlybird – even when you’re offline.\r\n• <b>Save your progress:</b> Your progress is automatically saved to the cloud when you see \"Progress saved by Play Games.\"\r\n• <b>Gamer profile:</b> Create a custom gamer ID, unlock achievements, earn XP, and level up.\r\n• <b>Gameplay recording:</b> Easily record and share your best gameplay moments.",
        "updated": 1756911276,
        "size": "",
        "version": "Varies with device",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.google.android.play.games"
      }
    },
    {
      "Roblox": {
        "appId": "com.roblox.client",
        "name": "Roblox",
        "icon": "https://play-lh.googleusercontent.com/7cIIPlWm4m7AGqVpEsIfyL-HW4cQla4ucXnfalMft1TMIYQIlf2vqgmthlZgbNAQoaQ",
        "developer": "Roblox Corporation",
        "genre": "Adventure",
        "score": 4.4262104,
        "installs": "1,000,000,000+",
        "summary": "Your next adventure awaits.",
        "description": "Roblox is the ultimate virtual universe that lets you create, share experiences with friends, and be anything you can imagine. Join millions of people and discover an infinite variety of immersive experiences created by a global community!\r\n\r\nAlready have an account? Log in with your existing Roblox account and explore the infinite metaverse of Roblox.\r\n\r\nMILLIONS OF EXPERIENCES\r\n\r\nIn the mood for an epic adventure? Want to compete against rivals worldwide? Or do you just want to hang out and chat with your friends online? A growing library of experiences created by the community means there’s always something new and exciting for you every day.\r\n\r\nEXPLORE TOGETHER ANYTIME, ANYWHERE\r\n\r\nTake the fun on the go. Roblox features full cross-platform support, meaning you can join your friends and millions of other people on their computers, mobile devices, Xbox One, or VR headsets.\r\n\r\nBE ANYTHING YOU CAN IMAGINE\r\n\r\nBe creative and show off your unique style! Customize your avatar with tons of hats, shirts, faces, gear, and more. With an ever-expanding catalog of items, there’s no limit to the looks you can create.\r\n\r\nCHAT WITH PEOPLE YOU KNOW\r\n\r\nParty is a seamless way for up to six friends to group up and jump into an experience together. Join people you know and stay together as you move across experiences. 13+ users can also use Party to chat through voice or text. It's never been easier to coordinate and communicate on Roblox.\r\n\r\nCREATE YOUR OWN EXPERIENCES: https://www.roblox.com/develop\r\nSUPPORT: https://en.help.roblox.com/hc/en-us\r\nCONTACT: https://corp.roblox.com/contact/\r\nPRIVACY POLICY: https://www.roblox.com/info/privacy\r\nPARENT’S GUIDE: https://corp.roblox.com/parents/\r\nTERMS OF USE: https://en.help.roblox.com/hc/en-us/articles/115004647846\r\n\r\nPLEASE NOTE: A network connection is required to join. Roblox works best over Wi-Fi.",
        "updated": 1757609035,
        "size": "",
        "version": "2.689.880",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.roblox.client"
      }
    },
    {
      "Subway Surfers": {
        "appId": "com.kiloo.subwaysurf",
        "name": "Subway Surfers",
        "icon": "https://play-lh.googleusercontent.com/FVWs-cooG28tz3GuKSaBKW_Rp91wLJxGxlmB9et_r-chKrjWpvXGxtRJWQi0QKithdM",
        "developer": "SYBO Games",
        "genre": "Arcade",
        "score": 4.5553255,
        "installs": "1,000,000,000+",
        "summary": "Help Jake, Tricky & Fresh escape from the grumpy Inspector and his dog!",
        "description": "DASH as fast as you can! \r\nDODGE the oncoming trains! \r\n\r\nHelp Jake, Tricky & Fresh escape from the grumpy Guard and his dog. \r\n\r\n★ Grind trains with your cool crew! \r\n★ Colorful and vivid HD graphics! \r\n★ Hoverboard Surfing! \r\n★ Paint powered jetpack! \r\n★ Lightning fast swipe acrobatics! \r\n★ Challenge and help your friends! \r\n\r\nJoin the most daring chase! \r\n\r\nA Universal App with HD optimized graphics.\r\n\r\nOriginally co-developed by SYBO and Kiloo.",
        "updated": 1757075670,
        "size": "",
        "version": "3.52.1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.kiloo.subwaysurf"
      }
    },
    {
      "Block Blast!": {
        "appId": "com.block.juggle",
        "name": "Block Blast!",
        "icon": "https://play-lh.googleusercontent.com/R0qgNDYYHbRhw6JFsdEbDMqONplEvJx0m0W9wzYVvY3eNF1c2rfBWYjQxW0sLEzFe1E",
        "developer": "HungryStudio",
        "genre": "Puzzle",
        "score": 4.8459787,
        "installs": "500,000,000+",
        "summary": "No WiFi? No worries! Play and relax anywhere, anytime.",
        "description": "Enter the world of Block Blast, a fun and free block puzzle game where every move challenges your brain and strategy, rewarding you with satisfying crush effects as you blast cubes away. Whether you're seeking offline relaxation or looking to enhance your logic skills, Block Blast delivers an engaging puzzle experience.\r\n\r\n🌟 Why You'll Love Block Blast\r\n🔸 Vibrant Puzzle Adventure: Match colorful blocks on an 8x8 board, solve logic puzzles, and watch the cubes crush in a cascade of color.\r\n🔹 Strategic Combos & Streaks: \r\nUse your brain to clear multiple lines of blocks in one move for powerful combos. Maintain your streaks to achieve massive scores!\r\n🔸 Casual Yet Challenging: Play at your own pace, relax your brain, or apply deep logic strategies to beat your highest score.\r\n🔹 Offline Fun, No WiFi Needed: Enjoy free block puzzle game anytime and anywhere, perfect for endless fun on-the-go.\r\n\r\n💥 Features of Block Blast\r\n● Puzzle Gameplay: Strategically place blocks and cubes, match colors, and solve each challenging level.\r\n● Adventure Mode: Take on progressively challenging puzzles, each level with unique theme jigsaw and visual styles.\r\n● Daily Challenges: Keep your brain sharp with daily logic puzzles and earn exclusive achievements.\r\n● Optimized for All Devices: Smooth, seamless gameplay experience with minimal memory usage—perfect for phones and tablets.\r\n\r\n🎮 How to Play\r\n● Drag & Match: Strategically place cubes on the 8x8 board.\r\n● Crush & Score: Complete rows or columns to crush blocks away and earn points.\r\n● Chase Combos: Plan your moves and trigger massive combos for bonus points.\r\n● Stay Strategic: Apply logic and strategy to prevent your board from filling up.\r\n\r\n✨ Pro Tips for Puzzle Masters\r\n● Plan Ahead: Visualize your moves to keep the board open for larger cubes.\r\n● Maximize Combos: Match multiple rows and blocks simultaneously to boost your combos.\r\n● Master the Streak: Consistent clears will maintain your fun streaks and enhance your score rewards.\r\n\r\n🔥 Jump into the Free Block Puzzle Game!\r\nReady to test your brain, sharpen your logic, and enjoy hours of offline puzzle fun? Download Block Blast now and embark on an unforgettable block puzzle adventure.",
        "updated": 1757742061,
        "size": "",
        "version": "8.0.5",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.block.juggle"
      }
    },
    {
      "Candy Crush Saga": {
        "appId": "com.king.candycrushsaga",
        "name": "Candy Crush Saga",
        "icon": "https://play-lh.googleusercontent.com/TLUeelx8wcpEzf3hoqeLxPs3ai1tdGtAZTIFkNqy3gbDp1NPpNFTOzSFJDvZ9narFS0",
        "developer": "King",
        "genre": "Casual",
        "score": 4.619665,
        "installs": "1,000,000,000+",
        "summary": "Match your way through candy puzzles packed with fun and clever challenges!",
        "description": "Explore a world full of delicious match-3 puzzles and endless fun! Blast through thousands of challenging levels in this timeless puzzle game from King. Match candies, conquer jelly, toffees, and jam, and uncover sweet surprises in every puzzle.\r\n\r\nClassic Match-3 Gameplay with Fresh Twists\r\n\r\n- Discover unique game modes like Gummy Dragons and Bubblegum Pop. \r\n- Match and blast your way through matching levels full of sugar-coated fun.\r\n- Master tricky puzzles and create explosive combos to clear the board!\r\n\r\nBrain-Boosting Challenges & Special Events\r\n\r\n- Daily Rewards: Log in every day to claim free boosters and extra lives.\r\n- Time-Limited Events: Compete in themed challenges and win exclusive prizes.\r\n- Tournaments & Leaderboards: Crush more candies than your friends and rise to the top to become the ultimate match-3 master!\r\n\r\nBonbon Blitz Your Way Through Extra Sticky Levels\r\n\r\n- Use powerful boosters like Bonbon Blitz, Lollipop Hammer, and Jelly Fish to solve puzzles and boost your score.\r\n- Stuck on a level? Boosters and extra moves will help you blast through any obstacle.\r\n\r\nPlay Offline or Online, Anytime and Anywhere\r\n\r\n- No internet, no problem: Enjoy offline gameplay and keep the fun going wherever you are.\r\n- Ad-free fun means uninterrupted candy-matching bliss!\r\n\r\nConnect with Friends & Join the Candy Kingdom\r\n\r\n- Share lives, compare scores, and see who’s the match-3 master in your friends circle.\r\n- Connect your game to Facebook to sync progress, compete with friends, and unlock exclusive rewards!\r\n\r\nDiscover more from King\r\n\r\nLooking for more brain-teasing fun? Try Candy Crush Soda Saga or Farm Heroes Saga for fresh twists on classic match-3 puzzles. Or dive into sweet solitaire action with the new Candy Crush Solitaire!\r\n\r\nCandy Crush Saga is free to play, but optional in-game items require payment. You can turn off the payment feature in your device’s settings.",
        "updated": 1757348684,
        "size": "",
        "version": "1.311.1.1",
        "android_version": "",
        "url": "https://play.google.com/store/apps/details?id=com.king.candycrushsaga"
      }
    }
  ]
}